In [ ]:
import pandas as pd
import mysql.connector

### mysql connector + pandas sql

In [3]:
# připojit k databázi - db object pro referenci na připojení
db = mysql.connector.connect(
  host="localhost", # server - u nás na PC localhost, jinak např. https://svatky.adresa.info/
  user="root", # přihlášení
  password="root",
  database="nova_databaze" # výběr schématu/db -> odpovídá sql: use nase_db;
)

In [4]:
sql = "select * from nahodni_lide;"

In [5]:
tabulka = pd.read_sql(sql, db)

C:\Users\cejs0\AppData\Local\Temp\ipykernel_6008\1999376274.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tabulka = pd.read_sql(sql, db)

In [6]:
tabulka

   rodne_cislo      jmeno   prijmeni  vek  adresa_id
0    136022139   Miloslav  Dvořáková   85          0
1    160029639       Erik   Zemanová   20          9
2    175801175       Ivan      Fišer   10          4
3    200804318      Lumír  Svobodová   95          3
4    285111618        Vít   Urbanová   15          6
5    451218306   Patricie      Urban   83          2
6    509141204  Stanislav    Machová   90          7
7   1254229768      Květa  Růžičková   53          1
8   2147483647     Ludvík     Bednář   88          5

### sql alchemy + pandas

In [7]:
from sqlalchemy import create_engine
from sqlalchemy import text

In [8]:
mysql_db = create_engine('mysql+pymysql://root:root@localhost/nova_databaze')

In [9]:
sql = "select * from nahodni_lide;"

In [10]:
tabulka = pd.read_sql(sql, mysql_db)
tabulka

   rodne_cislo      jmeno   prijmeni  vek  adresa_id
0    136022139   Miloslav  Dvořáková   85          0
1    160029639       Erik   Zemanová   20          9
2    175801175       Ivan      Fišer   10          4
3    200804318      Lumír  Svobodová   95          3
4    285111618        Vít   Urbanová   15          6
5    451218306   Patricie      Urban   83          2
6    509141204  Stanislav    Machová   90          7
7   1254229768      Květa  Růžičková   53          1
8   2147483647     Ludvík     Bednář   88          5